# 1、参数配置
# Parameters
nc: 80  # 所判断目标类别的种类，此处80类
depth_multiple: 0.33  # 模型层数因子 控制模型的深度（BottleneckCSP个数）
width_multiple: 0.50  # 模型通道数因子 控制Conv通道channel个数（卷积核数量）# 2、先验框配置
# anchors
anchors: # 9个anchor，其中P表示特征图的层级，P3/8该层特征图缩放为1/8,是第3层特征
  - [10,13, 16,30, 33,23]  # P3/8 FPN接主干网络下采样8倍后的anchor大小,检测小目标,10,13是一组尺寸，总共三组检测小目标
  - [30,61, 62,45, 59,119]  # P4/16 FPN接主干网络下采样4倍后的anchor大小,检测中目标，共三组
  - [116,90, 156,198, 373,326]  # P5/32 FPN接主干网络下采样2倍后的anchor大小,检测大目标，共三组# 3、backbone部分
# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2   [3, 32, 6, 2, 2]
   [-1, 1, Conv, [128, 3, 2]],    # 1-P2/4   [32, 64, 3, 2]
   [-1, 3, C3, [128]],            # 2        [64, 64, 1]
   [-1, 1, Conv, [256, 3, 2]],    # 3-P3/8   [64, 128, 3, 2]
   [-1, 6, C3, [256]],            # 4        [128, 128, 2]
   [-1, 1, Conv, [512, 3, 2]],    # 5-P4/16  [128, 256, 3, 2]
   [-1, 9, C3, [512]],            # 6        [256, 256, 3]
   [-1, 1, Conv, [1024, 3, 2]],   # 7-P5/32  [256, 512, 3, 2]
   [-1, 3, C3, [1024]],           # 8        [512, 512, 1]
   [-1, 1, SPPF, [1024, 5]],      # 9        [512, 512, 5]
  ]# 4、head部分
# YOLOv5 v6.0 head
head:
  # 前两个阶段是向上concat
  [[-1, 1, Conv, [512, 1, 1]],    # 10                 [512, 256, 1, 1]
   # nn.upsample不改变channel但是会把图片宽和高都变为2倍
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11    [None, 2, 'nearest']
   # 与上面backbone中的 P4阶段的最后一个输出做一个concat
   # 进行concat的两层必须大小相同、通道数相同 concat之后通道翻倍
   [[-1, 6], 1, Concat, [1]],  # 12 cat backbone P4    [1]
   [-1, 3, C3, [512, False]],  # 13                    [512, 256, 1, False]
 
   [-1, 1, Conv, [256, 1, 1]], # 14                    [256, 128, 1, 1]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   #15   [None, 2, 'nearest']
   [[-1, 4], 1, Concat, [1]],  # 16 cat backbone P3    [1]
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)       [256, 128, 1, False]
 
   # 后两个阶段是向下concat
   [-1, 1, Conv, [256, 3, 2]],  # 18                   [128, 128, 3, 2]
   [[-1, 14], 1, Concat, [1]],  # 19 cat head P4       [1]
   [-1, 3, C3, [512, False]],   # 20 (P4/16-medium)    [256, 256, 1, False]
 
   [-1, 1, Conv, [512, 3, 2]],  # 21                   [256, 256, 3, 2]
   [[-1, 10], 1, Concat, [1]],  # 22 cat head P5       [1]
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)     [512, 512, 1, False]
   # 有三个检测层，分别是在17层下面、20层下面、23层下面
   [[17, 20, 23], 1, Detect, [nc, anchors]],  # 24     [80，[[10，13，16，30，33，23]，[30，61.[128.256.512]1
  ]